#+TITLE: Keras Tutorial
#+AUTHOR: Maria Gonzalez Alegre
#+DATE: 2025-12-27
#+PROPERTY: header-args:python :session thesis :results output

** Embedding layer

Two separate embedding layers, one for tokens, one for token index (positions).

#+begin_src python :results output
class TokenAndPositionEmbedding(layers.Layer):
    def __init__(self, maxlen, vocab_size, embed_dim):
        super().__init__()
        self.token_emb = layers.Embedding(input_dim=vocab_size, output_dim=embed_dim)
        self.pos_emb = layers.Embedding(input_dim=maxlen, output_dim=embed_dim)

    def call(self, x):
        maxlen = ops.shape(x)[-1]
        positions = ops.arange(start=0, stop=maxlen, step=1)
        positions = self.pos_emb(positions)
        x = self.token_emb(x)
        return x + positions
#+end_src

#+RESULTS:

Downloading and preparing the dataset to use

#+begin_src python :results output
vocab_size = 20000  # Only consider the top 20k words
maxlen = 200  # Only consider the first 200 words of each movie review
(x_train, y_train), (x_val, y_val) = keras.datasets.imdb.load_data(num_words=vocab_size)
print(len(x_train), "Training sequences")
print(len(x_val), "Validation sequences")
x_train = keras.utils.pad_sequences(x_train, maxlen=maxlen)
x_val = keras.utils.pad_sequences(x_val, maxlen=maxlen)
#+end_src

#+RESULTS:
: 25000 Training sequences
: 25000 Validation sequences

** Training and Evaluation

#+BEGIN_SRC python :results output :session thesis
model.compile(optimizer="adam", loss="sparse_categorical_crossentropy", metrics=["accuracy"])

history = model.fit(
    x_train,
    y_train,
    batch_size=32,
    epochs=2,
    validation_data=(x_val, y_val),
    verbose=2,
)
#+END_SRC

#+RESULTS:
: Epoch 1/2
: 782/782 - 82s - 104ms/step - accuracy: 0.9553 - loss: 0.1285 - val_accuracy: 0.8588 - val_loss: 0.4051
: Epoch 2/2
: 782/782 - 99s - 127ms/step - accuracy: 0.9724 - loss: 0.0841 - val_accuracy: 0.8555 - val_loss: 0.4499
